{
"name": "Taiga Aisaka (逢坂 大河)",
"age:": 17,
"bio": 
"Taiga is a girl in Ryuuji's class. She has a well-regulated and beautiful appearance though is unable to stomach company from others. Due to her often snapping at others in brutal ways and her short stature, she is given the nickname "Palmtop Tiger."

Her under-developed body and the added nickname has given her a complex which in turn serves to give her a negative attitude and facial expression. Essentially, Taiga gets upset easily and is considerably clumsy. She is also brutally honest, typically when she is lashing out at someone. Due to her cute looks (described as a doll by Ryuuji), she often gets confessions of love by boys, but she turns down every one of them, including Yuusaku Kitamura (which she later regrets).

Despite coming from a well-to-do family, her life with them is very difficult because of various problems. Her father and mother got a divorce, leaving Taiga with her father. When he remarried another woman who was significantly younger than himself, it caused misunderstandings between Taiga and her step-mother. One day it became too much for Taiga, causing her to run away from home and since then, she has taken to living on her own. Since she came from a privileged household, she does not know how to do any domestic chores. When she meets Ryuuji and learns of his domestic talents, she ends up relying on Ryuuji to clean up after her. Aside from sleeping in her own house, and going to school, she spends most of her time at Ryuuji's house; so much so that she is considered a member of his family.

At the beginning of the story, she is infatuated with Ryuuji's best friend Yuusaku Kitamura and gets nervous every time he appears around her. Ryuuji finds out due to a misplaced empty love letter from Taiga meant for Kitamura. Ryuuji then admits to having feelings for Taiga's best friend Minori. Due to this, Taiga and Ryuuji team up to help each other get into a relationship with each other's best friend."
}